In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'Name':['Uwaish','Husain','Khan','Salman'],
                 'Age':[22,23,24,25],
                 'Gender':['M','M','F','M']})

df

     Name  Age Gender
0  Uwaish   22      M
1  Husain   23      M
2    Khan   24      F
3  Salman   25      M

In [3]:
# to download or save the dataframe

df.to_excel('test.xlsx')

In [5]:
# display first row

#df[0]   #not possible

In [7]:
df[0:1]

     Name  Age Gender
0  Uwaish   22      M

In [8]:
df[0:3]

     Name  Age Gender
0  Uwaish   22      M
1  Husain   23      M
2    Khan   24      F

In [6]:
# display name column

df[['Name']]

     Name
0  Uwaish
1  Husain
2    Khan
3  Salman

In [10]:
# display Name and Gender

df[['Name','Gender']]

     Name Gender
0  Uwaish      M
1  Husain      M
2    Khan      F
3  Salman      M

In [11]:
df['Name':'Gender']

TypeError: cannot do slice indexing on RangeIndex with these indexers [Name] of type str

In [12]:
df[:,'Name':'Gender']

InvalidIndexError: (slice(None, None, None), slice('Name', 'Gender', None))

**WAP to create a dataframe of your choice and then display first row, first col, and first two rows, first two columns**, emp_id, role and salary

## indexing methods

### iloc[ ]

In [13]:
df

     Name  Age Gender
0  Uwaish   22      M
1  Husain   23      M
2    Khan   24      F
3  Salman   25      M

In [14]:
# display first record

df.iloc[0]

Name      Uwaish
Age           22
Gender         M
Name: 0, dtype: object

In [15]:
# display first two records

df.iloc[0:2]

     Name  Age Gender
0  Uwaish   22      M
1  Husain   23      M

In [16]:
# display first column

df.iloc[:,0]

0    Uwaish
1    Husain
2      Khan
3    Salman
Name: Name, dtype: object

In [17]:
# display first two columns

df.iloc[:,0:2]

     Name  Age
0  Uwaish   22
1  Husain   23
2    Khan   24
3  Salman   25

### loc[ ]

In [18]:
df

     Name  Age Gender
0  Uwaish   22      M
1  Husain   23      M
2    Khan   24      F
3  Salman   25      M

In [19]:
# display first row

df.loc[0]

Name      Uwaish
Age           22
Gender         M
Name: 0, dtype: object

In [20]:
df2 = df.set_index('Name')

df2

        Age Gender
Name
Uwaish   22      M
Husain   23      M
Khan     24      F
Salman   25      M

In [22]:
# display Uwaish record

df2.loc['Uwaish']

Age       22
Gender     M
Name: Uwaish, dtype: object

In [23]:
df2.iloc['Uwaish']   #integer based

TypeError: Cannot index by location index with a non-integer key

In [24]:
# display rows from uwaish to khan

df2.loc['Uwaish':'Khan']

        Age Gender
Name
Uwaish   22      M
Husain   23      M
Khan     24      F

In [25]:
# display Age column

df2.loc[:,'Age']

Name
Uwaish    22
Husain    23
Khan      24
Salman    25
Name: Age, dtype: int64

In [26]:
# display all column after age

df2.loc[:,'Age':]

        Age Gender
Name
Uwaish   22      M
Husain   23      M
Khan     24      F
Salman   25      M

**WAP to create a dataframe of your choice and then display first row, first col, and first two rows, first two columns**, emp_id, role and salary. use iloc[]

**WAP to create a dataframe of your choice and then display first row, first col, and first two rows, first two columns**, emp_id, role and salary. use loc[]

In [27]:
df

     Name  Age Gender
0  Uwaish   22      M
1  Husain   23      M
2    Khan   24      F
3  Salman   25      M

In [29]:
# display record where age is above 22

df.loc[df['Age']>22]

     Name  Age Gender
1  Husain   23      M
2    Khan   24      F
3  Salman   25      M

In [30]:
df['Age']>22

0    False
1     True
2     True
3     True
Name: Age, dtype: bool

In [31]:
df[df['Age']>22]

     Name  Age Gender
1  Husain   23      M
2    Khan   24      F
3  Salman   25      M

In [32]:
# display the names whose age is above 22

df.loc[df['Age']>22,'Name']    #df.loc[condition,colmn]

1    Husain
2      Khan
3    Salman
Name: Name, dtype: object